package main

import (
	"fmt"
)

/* 

Создай переменную accountBalance (например, со значением 5000) и переменную withdrawal (сумма снятия, например, 1200).

Сделай проверку с помощью if с короткой инициализацией (или обычного if), чтобы проверить:

Если сумма снятия меньше или равна нулю, вывести ошибку («Некорректная сумма»).

Если сумма снятия больше текущего баланса, вывести («Недостаточно средств»).

Если всё ок, уменьшить баланс на сумму снятия и вывести остаток («Успешно! Остаток: ...»).

С помощью цикла for (в классическом стиле) выведи на экран фразу «Обработка транзакции...» 3 раза.

*/

func main() {
	var accountBalance int = 5000
	var withdrawal int = 1200

	for i := 1; i <= 3; i++ {
		fmt.Println("Обработка транзакции...")
	}

	if withdrawal <= 0 {
		fmt.Println("Ошибка! Некорректная сумма снятия.")
	} else if withdrawal > accountBalance {
		fmt.Println("Недостаточно средств") 
	} else {
		accountBalance -= withdrawal
		fmt.Println("Успешно! Остаток: ", accountBalance)
	}
}
