/*

Задание 2. Работа с примитивами, кортежами и массивами
Создай массив из 5 целых чисел (i32), представляющих уровень громкости трека в децибелах (например, [-12, -6, 0, -3, -15]).

Создай кортеж, описывающий трек: название (&str), длительность в секундах (u16) и флаг воспроизведения (bool).

Напиши цикл for, который проходит по массиву громкости, находит максимальное значение и выводит его.

*/

fn main() {
    let numbers: [i32; 5] = [-12, -6, 0, -3, -15];
    
    let mut max_num: i32 = -999;

    let track: (&str, u16, bool) = ("Faceless", 163, false);

    for num in numbers {
        if max_num < num {
            max_num = num;
        }
    }

    println!("Максимальное число: {}", max_num);
    println!("Трек: {}, длительность: {} сек, играет: {}", track.0, track.1, track.2);
}
